import { appIcons } from '@football/app/assets/icons/appIcons';
import { AppImages } from '@football/app/assets/images';
import { CardGoBack } from '@football/app/components/go-back/CardGoBack';
import { appStyles } from '@football/app/utils/constants/appStyles';
import React from 'react';
import { ImageBackground, SafeAreaView, ScrollView, StatusBar, Text, View } from 'react-native';
import { useViewModel } from '@football/app/screens/football-terms-conditon/TermsConditionScreen.viewModel';
import styles from '@football/app/screens/football-terms-conditon/TermsConditionScreen.style';
import { ITermsConditionScreenProps } from '@football/app/screens/football-terms-conditon/TermsConditionScreen.type';

export const TermsConditionScreen = ({ navigation, route }: ITermsConditionScreenProps) => {
    const { t, onGoBack } = useViewModel({ navigation, route });
    return (
        <View style={appStyles.flex}>
            <ImageBackground source={AppImages.img_background} style={appStyles.flex}>
                <StatusBar translucent backgroundColor="transparent" />
                <SafeAreaView style={appStyles.safe_area}>
                    <View style={appStyles.container}>
                        <CardGoBack
                            iconName={appIcons.ic_right_ios}
                            iconStyle={styles.ic_back}
                            goBack={onGoBack}
                            title={t('terms.title')}
                        />
                    </View>
                    <ScrollView>
                        <View style={styles.terms_container}>
                            <View>
                                <Text style={styles.terms_container_content}>
                                    ברוכים הבאים לאתר הרשמי של ההתאחדות לכדורגל בישראל
                                    www.football.org.il, שער הכניסה לאינטרנט של ההתאחדות לכדורגל
                                    בישראל (להלן - "ההתאחדות"). הנך מתבקש לקרוא את תנאי שימוש אלה
                                    בעיון ובקפידה. על ידי גישה לאתר אינטרנט זה ו/או לכל דף שבו (להלן
                                    - "האתר"), אתה מביע את הסכמתך ואת הבנתך לתנאי השימוש שלהלן ולכל
                                    מידע המתייחס הן לאתר זה והן למידע כלשהו שבו. אם אינך מסכים לתנאי
                                    שימוש אלו, אל תיגש לאתר זה. בנוסף, בשימוש בשירותים מסוימים אחרים
                                    המוצעים האתר, תידרש להסכים גם לתנאים מיוחדים לאותם שירותים אשר
                                    יופיעו באתר מעת לעת. האמור בתנאי שימוש אלה בלשון זכר נועד לנוחות
                                    בלבד, והם מתייחסים, כמובן, גם לנשים.ההתאחדות שומרת לעצמה את
                                    הזכות לשנות בכל עת את תנאי שימוש אלו מבלי לתת לך הודעה. על כן,
                                    אתה אחראי לעקוב באופן שוטף אחר תנאי שימוש אלו. המשך שימוש באתר
                                    זה בעקבות שינויים כלשהם כאלה יהווה הסכמתך לשינויים כאמור.אלא אם
                                    כן צוין מפורשות אחרת, החומר המפורסם באתר מיועד לצרכי מידע בלבד.
                                    האתר מאפשר למצוא תכנים ומידע המתפרסמים באינטרנט. יתכן ותמצא כי
                                    מידע ותכנים אלה אינם הולמים את צרכיך, או שאתה מתנגד לתוכנם, או
                                    סבור כי הם מקוממים, פוגעים, מרגיזים, בלתי נאותים, בלתי
                                    חוקיים.ההתאחדות אינה אחראית בכל צורה שהיא לתוכנם של האתרים
                                    שאליהם מוליכים הקישורים באתר. העובדה שתמצא באתר קישור לאתר מסוים
                                    אינה מהוה אישור לכך שהמידע באתר זה מלא, מהימן, עדכני או אמין.
                                    ההתאחדות לא תהיה אחראית לכל נזק ישיר או עקיף, כספי או אחר,
                                    שייגרם לך כתוצאה משימוש או הסתמכות על המידע המתפרסם באתרים
                                    חיצוניים, שאליהם תגיע באמצעות איזה מהשירותים באתר.באתר מתפרסם
                                    מידע - כדוגמת סגלי קבוצות ו/או זכיות בתארים ו/או מועדי משחקים
                                    ו/או לוחות משחקים ו/או טבלאות ובהן נתונים שונים. מידע זה מוגש
                                    כשירות לציבור בלבד והוא עשוי להתעדכן מעת לעת. ההתאחדות אינה
                                    אחראית על תוכנו של המידע. קודם להסתמכות על כל מידע כאמור, מומלץ
                                    לבדוק במקרה המתאים את תוכנו באופן עצמאי.באתר תמצא מידע על מועדי
                                    משחקים ו/או לוחות משחקים ו/או טבלאות ליגות ובהן נתונים שונים
                                    ו/או נתונים אודות קבוצות המסונפות להתאחדות. ההתאחדות פועלת כמיטב
                                    יכולתה כדי לרכז ולעבד את הנתונים הללו תוך זמן קצר מקבלתם. עם זאת
                                    יתכן שבתהליך קליטתם, עיבודם ופרסומם יפלו טעויות. בנוסף, המידע
                                    עשוי לא להיות מעודכן במועד פרסומו, לכן, אם ברצונך להשתמש במידע
                                    זה עליך לבדוק אותו ולאמתו טרם השימוש. ההתאחדות לא תישא באחריות
                                    לטעויות בנתונים, ואין בפרסומם משום אישור רשמי של ההתאחדות. על אף
                                    שההתאחדות נתנה את כל תשומת הלב הנדרשת לכך שהמידע הכלול באתר זה
                                    יהיה מדויק במועד הפרסום, לא ניתנים כל מצג או אחריות (לרבות חבות
                                    כלפי צדדים שלישיים), בין מפורשים ובין משתמעים, לגבי דיוקו,
                                    אמינותו או שלמותו. לכן, כל החלטה בדבר השימוש במידע שתמצא באתר
                                    יעשה על אחריותך בלבד.ההתאחדות מעודדת אותך להתייחס בזהירות
                                    ובביקורתיות למידע שמתפרסם באתר, ובכלל זה למידע שמתפרסם באינטרנט,
                                    ובכלל זה למידע שמפרסמים משתמשים באתר בכלל, בקבוצות הדיון או בדף
                                    הצא'ט בפרט. התייחס למידע זה בזהירות ובקפידה. המידע אינו מתפרסם
                                    מטעמה של ההתאחדות, ולפיכך היא אינה אחראית למהימנותו, אמינותו,
                                    דיוקו, עדכניותו או שלמותו. ההתאחדות אינה אחראית לאינפורמציה או
                                    לדעות שיתפרסמו בדף הצ'אט באתר - המידע וההודאות באתרים אלו אינם
                                    על דעתה של ההתאחדות והיא אינה עומדת מאחוריהם.אתה מאשר ומסכים כי
                                    להתאחדות אין אחריות בנוגע לדיוק או לזמינות של מידע, חומר או תוכן
                                    המסופקים על ידי אתרים מקושרים של צדדים שלישיים (Links) או בנוגע
                                    לתוכן, תפקוד, תנאי השימוש או מדיניות שמירת הפרטיות כאמור. האתר
                                    כולל מידע מסחרי, הנמסר לפרסום מטעמם של מפרסמים שונים. מידע כאמור
                                    יכול שיהיה בטקסט, בתמונות, בקול או במולטימדיה. ההתאחדות לא תישא
                                    בכל אחריות לתוכן המידע המסחרי, הפרסומות ומודעות הלוח שיפורסמו
                                    באתר. ההתאחדות אינה כותבת, בודקת, מוודאת או עורכת את תוכן
                                    הפרסומים הללו או אמיתותם. האחריות היחידה לתוכן המודעות והמידע
                                    המסחרי חלה על המפרסמים. ההתאחדות עצמה אינה מכירה את משתמשי האתר,
                                    ואין ביכולתה לבקר את אמיתות המידע שהם מוסרים לפרסום.ההתאחדות לא
                                    תהיה אחראית, ולא תחוב, בין ישירות ובין בעקיפין, לכל נזק או הפסד
                                    שנגרם, או שנגרם לכאורה, על ידי או בקשר לשימוש או הסתמכות על כל
                                    תוכן, מוצרים או חומר אחר כזה המצוי באתר או באתרים מקושרים של
                                    צדדים שלישיים.השירותים והמידע באתר ניתנים לשימוש כמות שהם (As
                                    is) ובסיכונך האישי בלבד, ללא אחריות משום סוג, בין מפורשת ובין
                                    משתמעת. לא ניתן להתאימם לצרכיו של כל אדם ואדם. לא תהיה לך כל
                                    טענה, תביעה או דרישה כלפי ההתאחדות בגין תכונות של השירותים,
                                    יכולותיהם, מגבלותיהם, התאמתם לצרכיך או התגובות שיעורר (אם בכלל)
                                    פרסום פרטים, מידע או קבצים מטעמך באתר. השימוש בשירותים ייעשה
                                    אפוא על אחריותך הבלעדית והמלאה. המידע שתמסור לפרסום באתר יהיה
                                    חשוף לכל משתמשי האינטרנט. נהג בתבונה ובזהירות בתגובות ובפניות
                                    שיתקבלו אצלך בעקבות השימוש באתר זה או פרסום איזה מפרטיך בו, כשם
                                    שעליך לנהוג בכל יצירת קשר, שאינה נעשית באמצעות האינטרנט.ההתאחדות
                                    אינה מתחייבת, כי למסרים, למידע או למודעות שתפרסם באתר תהיה
                                    היענות. ההתאחדות אינה יכולה לדעת אילו תגובות (אם בכלל) תקבל
                                    בעקבות הפרסום ומי יגיע למידע שתפרסם, ולכן לא תישא כלפיך (או כלפי
                                    מי מטעמך) באחריות כלשהי לתגובות הללו, לזהות הפונים אליך או לכל
                                    תוצאה שתנבע מהפרסום. ההתאחדות לא תהיה גם אחראית לכל שימוש שייעשה
                                    על ידי צד שלישי בפרטים שיפורסמו על-ידך.ההתאחדות עצמה אינה מכירה
                                    את משתמשי האתר, ואין ביכולתה לבקר את אמיתות המידע שהם מוסרים
                                    לפרסום. ההתאחדות לא תישא באחריות כלשהי לכל תוצאה שתנבע ממידע
                                    שפורסם באתר זה על-ידי צדדים שלישיים.קישורית אל אתר זה אינה
                                    מאפשרת לך להשתמש בתוכן, שמות, סימנים, תמונות או סימנים רשומים של
                                    ההתאחדות ו/או צד שלישי, אלא אם הוסכם הדבר בכתב בנפרד על ידי בעלי
                                    הזכויות המתאימים.ההתאחדות אינה מתחייבת שהשירותים באתר לא יופרעו,
                                    יינתנו כסדרם או בלא הפסקות, יתקיימו בבטחה וללא טעויות ויהיו
                                    חסינים מפני גישה בלתי-מורשית למחשבי ההתאחדות או מפני נזקים,
                                    קלקולים, תקלות או כשלים - והכל, בחומרה, בתוכנה, בקווי ובמערכות
                                    תקשורת, אצל ההתאחדות או אצל מי מספקיה.ההתאחדות תוכל לשנות מעת
                                    לעת את מבנה האתר הכולל את מראם, היקפם, תוכנם וזמינותם של
                                    השירותים הניתנים באתר וכל היבט אחר הכרוך בהם - והכל, בלא צורך
                                    להודיע לך על כך מראש. שינויים כאלה יבוצעו, בין השאר, בהתחשב
                                    באופי הדינמי של האינטרנט ובשינויים הטכנולוגיים והאחרים המתרחשים
                                    בו. מטבעם, שינויים מסוג זה עלולים להיות כרוכים בתקלות או לעורר
                                    בתחילה אי-נוחות וכיו"ב. לא תהיה לך כל טענה, תביעה או דרישה כלפי
                                    ההתאחדות בגין ביצוע שינויים כאמור או תקלות שיתרחשו אגב
                                    ביצועם.השירותים באתר ניתנים בלא תשלום. מסיבה זאת רשאית ההתאחדות
                                    להפסיק בכל עת את מתן השירותים, כולם או מקצתם, על פי שיקול דעתה
                                    הבלעדי. ההתאחדות תהיה רשאית למחוק את החומר הכלול באתר בלא לשמור
                                    כל גיבוי ממנו ובלא לתת הודעה נוספת על כך.מבלי לפגוע באמור לעיל,
                                    אין ההתאחדות אחראית לכל אובדן של מידע מכל סוג, שייגרם מכל סיבה
                                    שהיא. לא תישמע כל טענה נגד ההתאחדות שמקורה בהסמכות כלשהי על מידע
                                    שהתפרסם בזמן מסוים באתר.כתנאי לשימוש באתר, אתה מסכים לשפות את
                                    ההתאחדות, בעלי התפקידים בה, עובדיה וסוכניה על כל החבויות,
                                    ההוצאות (לרבות שכר טרחת עורכי דין) והנזקים שמקורם מתביעות
                                    הנובעות משמושך באתר.על השימוש באתר יחולו אך ורק דיני מדינת
                                    ישראל.מקום השיפוט הבלעדי בגין כל דבר ועניין הנובע מהסכם זה או
                                    מהאתר הנו בבתי המשפט המוסכמים במחוזות תל-אביב והמרכז בישראל.
                                </Text>
                            </View>
                        </View>
                    </ScrollView>
                </SafeAreaView>
            </ImageBackground>
        </View>
    );
};
