import { useAppNavigator } from '@football/app/routes/AppNavigator.handler';
import { useTranslation } from 'react-i18next';
import { IMagazineScreenProps } from './MagazineScreen.type';

export const useViewModel = ({ navigation, route }: IMagazineScreenProps) => {
    const { navigate, goBack } = useAppNavigator();
    const { t } = useTranslation();
    const onGoBack = (): void => {
        goBack();
    };

    const contents = [
        'יו״ר ועד איגוד השופטים, משה בוחבוט, ומנהל הליגות החובבניות בהתאחדות לכדורגל גיא גולדפרב ביקרו אתמול באימון קבוצת צעירי לוד מליגה ג׳ ושוחחו עם השחקנים והצוות, זאת בהמשך לדיון בוועדת ליגות א׳-ג׳ והצעדים האופרטיביים לחיזוק הקשר בין צוותי השיפוט למועדונים ולמיגור האלימות.',

        'יו״ר ועד איגוד השופטים, משה בוחבוט, ומנהל הליגות החובבניות בהתאחדות לכדורגל גיא גולדפרב ביקרו אתמול באימון קבוצת צעירי לוד מליגה ג׳ ושוחחו עם השחקנים והצוות, זאת בהמשך לדיון בוועדת ליגות א׳-ג׳ והצעדים האופרטיביים לחיזוק הקשר בין צוותי השיפוט למועדונים ולמיגור האלימות.',

        'יו״ר ועד איגוד השופטים, משה בוחבוט, ומנהל הליגות החובבניות בהתאחדות לכדורגל גיא גולדפרב ביקרו אתמול באימון קבוצת צעירי לוד מליגה ג׳ ושוחחו עם השחקנים והצוות, זאת בהמשך לדיון בוועדת ליגות א׳-ג׳ והצעדים האופרטיביים לחיזוק הקשר בין צוותי השיפוט למועדונים ולמיגור האלימות.',
    ];

    return {
        t,
        onGoBack,
        contents,
    };
};
